import { iDepartment } from "./../models/interfaces";

// roleIds: ["department_sv", "CMAs", "NSV", "MANAGER", "BoD"];
export const tickets: iDepartment[] = [
	{
		name: "Driver Department",
		guild: {
			channelId: "780500364448235530",
			roleIds: [
				"770360459114315806",
				"777615536997531669",
				"735204683475583008",
				"742791627495571596",
				"742790053998362768",
			],
		},
		emojis: {
			main: "793907766476668938",
			fallback: "1️⃣",
		},
	},
	{
		name: "Dispatch Department",
		guild: {
			channelId: "780500364448235530",
			roleIds: [
				"770360455763198032",
				"777615536997531669",
				"735204683475583008",
				"742791627495571596",
				"742790053998362768",
			],
		},
		emojis: {
			main: "793907746390933534",
			fallback: "2️⃣",
		},
	},
	{
		name: "Guard Department",
		guild: {
			channelId: "780500364448235530",
			roleIds: [
				"770360452395171872",
				"777615536997531669",
				"735204683475583008",
				"742791627495571596",
				"742790053998362768",
			],
		},
		emojis: {
			main: "793907789349126214",
			fallback: "3️⃣",
		},
	},
	{
		name: "Signaller Department",
		guild: {
			channelId: "780500364448235530",
			roleIds: [
				"807768040086437897",
				"777615536997531669",
				"735204683475583008",
				"742791627495571596",
				"742790053998362768",
			],
		},
		emojis: {
			main: "793907789349126214",
			fallback: "4️⃣",
		},
	},
	{
		name: "Any Department",
		guild: {
			channelId: "780500364448235530",
			roleIds: [
				"742790430034362440",
				"777615536997531669",
				"735204683475583008",
				"742791627495571596",
				"742790053998362768",
			],
		},
		emojis: {
			main: "818564584679538708",
			fallback: "5️⃣",
		},
	},
	{
		name: "Any Department",
		guild: {
			channelId: "792005203867729921",
			roleIds: [
				"739540543570444368",
				"777615536997531669",
				"735204683475583008",
				"742791627495571596",
				"742790053998362768",
			],
		},
		emojis: {
			main: "740924664926437481",
			fallback: "6️⃣",
		},
	},
];

export const category = "754266502638600233";
